[
    {
        "name": "Request Map",
        "owner": "Simon Hearne",
        "ownerLink": "https://simonhearne.com/",
        "description": "Generate a node map of all the requests on a page to identify what third-parties are on your site, where your transmitted bytes are coming from and how slow your domains are.",
        "link": "https://requestmap.webperf.tools/"
    },
    {
        "name": "AutoWebPerf",
        "owner": "The Google Chrome Team",
        "ownerLink": "https://github.com/GoogleChromeLabs",
        "description": "AutoWebPerf provides a flexible and scalable framework for running web performance audits with arbitrary audit tools like WebPageTest and PageSpeedInsights. This library enables developers to collect metrics consistently and store metrics to a preferred data store such as local JSON files, Google Sheets, BigQuery, or an in-house SQL database.",
        "link": "https://github.com/GoogleChromeLabs/AutoWebPerf"
    },
    {
        "name": "WebPageTest Bulk Tester",
        "owner": "Andy Davies",
        "ownerLink": "https://andydavies.me/",
        "description": "Use Google Sheets to test multiple URLs using WebPageTest using configurable test settings. As tests complete, the metric values you request will be automatically added to your spreadsheet for furhter analysis.",
        "link": "https://github.com/andydavies/WPT-Bulk-Tester"
    },
    {
        "name": "What Does My Site Cost?",
        "owner": "Tim Kadlec",
        "ownerLink": "https://timkadlec.com/",
        "description": "Find out how much it costs for someone to use your site on mobile networks around the world.",
        "link": "https://whatdoesmysitecost.com/"
    },
    {
        "name": "Image Analysis Tool",
        "owner": "Cloudinary",
        "ownerLink": "https://cloudinary.com/",
        "description": "The Image Analysis Tool provides measurable and actionable information about how to go beyond simple compression: discover how changes to image size, format selection, quality and encoding can dramatically improve page load speed.",
        "link": "https://webspeedtest.cloudinary.com/"
    },
    {
        "name": "Snyk Website Vulnerability Scanner",
        "owner": "Snyk",
        "ownerLink": "https://snyk.io/",
        "description": "Snyk's WebSite Scanner surfaces a security grade and details about specfic security headers that could be used to improve your site's security, as well as any vulnerable JavaScript libraries that were found during testing.",
        "link": "https://snyk.io/website-scanner"
    },
    {
        "name": "FRUSTRATIONindex",
        "owner": "Tim Vereecke",
        "ownerLink": "https://twitter.com/TimVereecke",
        "description": "Easily calculate the frustration levels of your website using any WPT result page. FRUSTRATIONindex is an easy to consume score indicating the level of frustration while loading a page.",
        "link": "https://www.frustrationindex.com/"
    },
    {
        "name": "Sifty",
        "owner": "Brian Louis Ramirez",
        "ownerLink": "https://screenspan.net/",
        "description": "Sifty is a simple web app that lets you parse WebPageTest and Google Lighthouse JSON test results files so you can “sift through” network requests by URL, filter them by their render-blocking status or sort them. You can save all or selected requests as a CSV file so you can compare the requests from multiple test results. That can help you answer questions such as: Exactly which requests were removed? How many bytes or requests did we save? How many stylesheets, scripts, images, etc. did we have before and after?",
        "link": "https://screenspan.net/sifty/"
    },
    {
        "name": "WebPageTest Gauntlet",
        "owner": "Josh Nelson",
        "ownerLink": "https://twitter.com/nelsonjoshpaul",
        "description": "Run a single page through WebPageTest many times for benchmarking purposes. Extract full chrome traces, or summary data.",
        "link": "https://github.com/jpnelson/wpt-gauntlet"
    }
]